{"class_name": "Model", "config": {"name": "SemiDense_with_LoG", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 36, 21, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TensorFlowOpLayer", "config": {"name": "MirrorPad", "trainable": false, "dtype": "float32", "node_def": {"name": "MirrorPad", "op": "MirrorPad", "input": ["input_1", "MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "U1lNTUVUUklD"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[0, 0], [6, 6], [0, 0], [0, 0]]}}, "name": "tf_op_layer_MirrorPad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "MirrorPad_1", "trainable": false, "dtype": "float32", "node_def": {"name": "MirrorPad_1", "op": "MirrorPad", "input": ["MirrorPad", "MirrorPad_1/paddings"], "attr": {"mode": {"s": "U1lNTUVUUklD"}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, "constants": {"1": [[0, 0], [6, 6], [0, 0], [0, 0]]}}, "name": "tf_op_layer_MirrorPad_1", "inbound_nodes": [[["tf_op_layer_MirrorPad", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LoG1", "trainable": false, "dtype": "float32", "node_def": {"name": "LoG1", "op": "Conv2D", "input": ["MirrorPad", "LoG1/filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, "constants": {"1": [[[[-0.03824514150619507]]], [[[-0.09926600009202957]]], [[[-0.17472045123577118]]], [[[-0.17463858425617218]]], [[[-0.0]]], [[[0.28483012318611145]]], [[[0.4303397536277771]]], [[[0.28483012318611145]]], [[[-0.0]]], [[[-0.17463858425617218]]], [[[-0.17472045123577118]]], [[[-0.09926600009202957]]], [[[-0.03824514150619507]]]]}}, "name": "tf_op_layer_LoG1", "inbound_nodes": [[["tf_op_layer_MirrorPad", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LoG2", "trainable": false, "dtype": "float32", "node_def": {"name": "LoG2", "op": "Conv2D", "input": ["MirrorPad_1", "LoG2/filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, "constants": {"1": [[[[-0.018509047105908394]]], [[[-0.031153907999396324]]], [[[-0.04804058372974396]]], [[[-0.06731389462947845]]], [[[-0.08455738425254822]]], [[[-0.09289658814668655]]], [[[-0.08451775461435318]]], [[[-0.053635112941265106]]], [[[-0.0]]], [[[0.0687783882021904]]], [[[0.13784584403038025]]], [[[0.18924255669116974]]], [[[0.20826640725135803]]], [[[0.18924255669116974]]], [[[0.13784584403038025]]], [[[0.0687783882021904]]], [[[-0.0]]], [[[-0.053635112941265106]]], [[[-0.08451775461435318]]], [[[-0.09289658814668655]]], [[[-0.08455738425254822]]], [[[-0.06731389462947845]]], [[[-0.04804058372974396]]], [[[-0.031153907999396324]]], [[[-0.018509047105908394]]]]}}, "name": "tf_op_layer_LoG2", "inbound_nodes": [[["tf_op_layer_MirrorPad_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LoG1_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LoG1_Conv2D", "inbound_nodes": [[["tf_op_layer_LoG1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LoG2_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LoG2_Conv2D", "inbound_nodes": [[["tf_op_layer_LoG2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["tf_op_layer_LoG1", 0, 0, {}], ["tf_op_layer_LoG2", 0, 0, {}], ["LoG1_Conv2D", 0, 0, {}], ["LoG2_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF1_BatchNorm", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF1_ReLu", "inbound_nodes": [[["B1_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF1_Conv2D", "inbound_nodes": [[["B1_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B1_CF1_Dropout", "inbound_nodes": [[["B1_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B1_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B1_CF2_BatchNorm", "inbound_nodes": [[["B1_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B1_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B1_CF2_ReLu", "inbound_nodes": [[["B1_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B1_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B1_CF2_Conv2D", "inbound_nodes": [[["B1_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B1_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B1_CF2_Dropout", "inbound_nodes": [[["B1_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B1_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B1_Concat", "inbound_nodes": [[["concatenate", 0, 0, {}], ["B1_CF1_Dropout", 0, 0, {}], ["B1_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T1_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T1_CF_BatchNorm", "inbound_nodes": [[["B1_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T1_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T1_CF_ReLu", "inbound_nodes": [[["T1_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T1_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 50, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T1_CF_Conv2D", "inbound_nodes": [[["T1_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T1_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "T1_CF_Dropout", "inbound_nodes": [[["T1_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "T1_Pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "T1_Pool", "inbound_nodes": [[["T1_CF_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF1_BatchNorm", "inbound_nodes": [[["T1_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF1_ReLu", "inbound_nodes": [[["B2_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF1_Conv2D", "inbound_nodes": [[["B2_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B2_CF1_Dropout", "inbound_nodes": [[["B2_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B2_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B2_CF2_BatchNorm", "inbound_nodes": [[["B2_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B2_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B2_CF2_ReLu", "inbound_nodes": [[["B2_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B2_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B2_CF2_Conv2D", "inbound_nodes": [[["B2_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B2_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B2_CF2_Dropout", "inbound_nodes": [[["B2_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B2_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B2_Concat", "inbound_nodes": [[["T1_Pool", 0, 0, {}], ["B2_CF1_Dropout", 0, 0, {}], ["B2_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T2_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T2_CF_BatchNorm", "inbound_nodes": [[["B2_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T2_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T2_CF_ReLu", "inbound_nodes": [[["T2_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T2_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 74, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T2_CF_Conv2D", "inbound_nodes": [[["T2_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T2_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "T2_CF_Dropout", "inbound_nodes": [[["T2_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "T2_Pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 2], "data_format": "channels_last"}, "name": "T2_Pool", "inbound_nodes": [[["T2_CF_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF1_BatchNorm", "inbound_nodes": [[["T2_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF1_ReLu", "inbound_nodes": [[["B3_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF1_Conv2D", "inbound_nodes": [[["B3_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B3_CF1_Dropout", "inbound_nodes": [[["B3_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B3_CF2_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B3_CF2_BatchNorm", "inbound_nodes": [[["B3_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B3_CF2_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B3_CF2_ReLu", "inbound_nodes": [[["B3_CF2_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B3_CF2_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B3_CF2_Conv2D", "inbound_nodes": [[["B3_CF2_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B3_CF2_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B3_CF2_Dropout", "inbound_nodes": [[["B3_CF2_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B3_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B3_Concat", "inbound_nodes": [[["T2_Pool", 0, 0, {}], ["B3_CF1_Dropout", 0, 0, {}], ["B3_CF2_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "T3_CF_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "T3_CF_BatchNorm", "inbound_nodes": [[["B3_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "T3_CF_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "T3_CF_ReLu", "inbound_nodes": [[["T3_CF_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "T3_CF_Conv2D", "trainable": true, "dtype": "float32", "filters": 98, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "T3_CF_Conv2D", "inbound_nodes": [[["T3_CF_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "T3_CF_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "T3_CF_Dropout", "inbound_nodes": [[["T3_CF_Conv2D", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "T3_Pool", "trainable": true, "dtype": "float32", "pool_size": [2, 3], "padding": "valid", "strides": [2, 3], "data_format": "channels_last"}, "name": "T3_Pool", "inbound_nodes": [[["T3_CF_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "B4_CF1_BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "B4_CF1_BatchNorm", "inbound_nodes": [[["T3_Pool", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "B4_CF1_ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "B4_CF1_ReLu", "inbound_nodes": [[["B4_CF1_BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "B4_CF1_Conv2D", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "B4_CF1_Conv2D", "inbound_nodes": [[["B4_CF1_ReLu", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "B4_CF1_Dropout", "trainable": true, "dtype": "float32", "rate": 0.01, "noise_shape": null, "seed": null}, "name": "B4_CF1_Dropout", "inbound_nodes": [[["B4_CF1_Conv2D", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "B4_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "B4_Concat", "inbound_nodes": [[["T3_Pool", 0, 0, {}], ["B4_CF1_Dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-08, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["B4_Concat", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ReLu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ReLu", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d", "inbound_nodes": [[["ReLu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC-D1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC-D1", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BatchNorm-D1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BatchNorm-D1", "inbound_nodes": [[["FC-D1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ReLu-D1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ReLu-D1", "inbound_nodes": [[["BatchNorm-D1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Logits", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Logits", "inbound_nodes": [[["ReLu-D1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["Logits", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}